Repository: KiYouJyo/UCAD
Catalog: src/UCAD.App/Strings/*/AuthoringLive.resw
Source language: en_us
Languages: ja_jp, zh_cn

# AuthoringFailedFormat
source: {0} failed: {1}
ja_jp: {0} の実行に失敗しました: {1}
zh_cn: {0} 执行失败：{1}

# LayerComplete
source: Layer Manager closed.
ja_jp: レイヤーマネージャーを閉じました。
zh_cn: 图层管理器已关闭。

# PropertiesComplete
source: Object properties updated.
ja_jp: オブジェクトのプロパティを更新しました。
zh_cn: 对象属性已更新。

# TextInsertionPoint
source: TEXT: specify insertion point.
ja_jp: TEXT: 文字の挿入点を指定してください。
zh_cn: TEXT：指定文字插入点。

# TextComplete
source: Text created.
ja_jp: 文字を作成しました。
zh_cn: 文字已创建。

# DimFirstPoint
source: DIM: specify first extension-line origin.
ja_jp: DIM: 1 本目の寸法補助線の起点を指定してください。
zh_cn: DIM：指定第一条尺寸界线原点。

# DimSecondPoint
source: DIM: specify second extension-line origin.
ja_jp: DIM: 2 本目の寸法補助線の起点を指定してください。
zh_cn: DIM：指定第二条尺寸界线原点。

# DimLinePoint
source: DIM: specify dimension-line location.
ja_jp: DIM: 寸法線の位置を指定してください。
zh_cn: DIM：指定尺寸线位置。

# DimComplete
source: Linear dimension created.
ja_jp: 長さ寸法を作成しました。
zh_cn: 线性标注已创建。

# HatchNeedsBoundary
source: HATCH requires one selected closed polyline or circle.
ja_jp: HATCH では閉じたポリラインまたは円を 1 つ選択してください。
zh_cn: HATCH 需要先选择一个闭合多段线或圆。

# HatchComplete
source: Solid hatch created.
ja_jp: ソリッドハッチを作成しました。
zh_cn: 实体填充已创建。

# BlockNeedsSelection
source: BLOCK requires a selection.
ja_jp: BLOCK では先にオブジェクトを選択してください。
zh_cn: BLOCK 需要先选择对象。

# BlockNameTitle
source: Create Block
ja_jp: ブロックを作成
zh_cn: 创建图块

# BlockNamePrompt
source: Block name
ja_jp: ブロック名
zh_cn: 图块名称

# BlockBasePoint
source: BLOCK: specify base point.
ja_jp: BLOCK: 基点を指定してください。
zh_cn: BLOCK：指定图块基点。

# BlockCompleteFormat
source: Block '{0}' defined.
ja_jp: ブロック「{0}」を定義しました。
zh_cn: 图块“{0}”已定义。

# InsertNoBlocks
source: No block definitions are available.
ja_jp: 挿入できるブロック定義がありません。
zh_cn: 当前图纸没有可插入的图块定义。

# InsertPoint
source: INSERT: specify insertion point.
ja_jp: INSERT: 挿入点を指定してください。
zh_cn: INSERT：指定插入点。

# InsertCompleteFormat
source: Block '{0}' inserted.
ja_jp: ブロック「{0}」を挿入しました。
zh_cn: 图块“{0}”已插入。

# ExplodeNeedsOneBlock
source: EXPLODE requires exactly one selected block reference.
ja_jp: EXPLODE ではブロック参照を 1 つだけ選択してください。
zh_cn: EXPLODE 需要且仅能选择一个图块参照。

# ExplodeCompleteFormat
source: Block exploded into {0} objects.
ja_jp: ブロックを {0} 個のオブジェクトに分解しました。
zh_cn: 图块已分解为 {0} 个对象。

# LayerCurrent
source: Current layer
ja_jp: 現在のレイヤー
zh_cn: 当前图层

# LayerNewName
source: New layer name
ja_jp: 新しいレイヤー名
zh_cn: 新图层名称

# LayerAdd
source: Add
ja_jp: 追加
zh_cn: 添加

# LayerVisible
source: On
ja_jp: 表示
zh_cn: 开

# LayerLocked
source: Lock
ja_jp: ロック
zh_cn: 锁定

# LayerApply
source: Apply
ja_jp: 適用
zh_cn: 应用

# LayerDelete
source: Delete
ja_jp: 削除
zh_cn: 删除

# LayerManagerTitle
source: Layer Manager
ja_jp: レイヤーマネージャー
zh_cn: 图层管理器

source: Close
ja_jp: 閉じる
zh_cn: 关闭

# PropertiesNeedsSelection
source: CHPROP requires a selection.
ja_jp: CHPROP では先にオブジェクトを選択してください。
zh_cn: CHPROP 需要先选择对象。

# PropertyLayer
source: Layer
ja_jp: レイヤー
zh_cn: 图层

# PropertyColor
source: Color (#RRGGBB)
ja_jp: 色（#RRGGBB）
zh_cn: 颜色（#RRGGBB）

# PropertyLineWeight
source: Lineweight
ja_jp: 線の太さ
zh_cn: 线宽

# PropertyLineType
source: Linetype
ja_jp: 線種
zh_cn: 线型

source: ByLayer
zh_cn: 随层

# PropertiesTitleFormat
source: Properties — {0} selected
ja_jp: プロパティ — {0} 個選択
zh_cn: 属性 — 已选择 {0} 个对象

source: Apply
ja_jp: 適用
zh_cn: 应用

source: Cancel
ja_jp: キャンセル
zh_cn: 取消

# InvalidLineWeight
source: Lineweight must be a positive number.
ja_jp: 線の太さは正の数で指定してください。
zh_cn: 线宽必须为正数。

# TextContent
source: Text
ja_jp: 文字列
zh_cn: 文字内容

source: Text height
ja_jp: 文字高さ
zh_cn: 文字高度

source: Rotation (degrees)
ja_jp: 回転角（度）
zh_cn: 旋转角（度）

# TextDialogTitle
source: Text
ja_jp: 文字
zh_cn: 单行文字

source: Create
ja_jp: 作成
zh_cn: 创建

# InsertBlock
source: Block
ja_jp: ブロック
zh_cn: 图块

# InsertScale
source: Scale
ja_jp: 尺度
zh_cn: 比例

# InsertDialogTitle
source: Insert Block
ja_jp: ブロックを挿入
zh_cn: 插入图块

source: Continue
ja_jp: 続行
zh_cn: 继续

# InspectorPropertySummaryFormat
source: Layer: {0} Color: {1} Lineweight: {2} Linetype: {3}
ja_jp: レイヤー: {0} 色: {1} 線の太さ: {2} 線種: {3}
zh_cn: 图层：{0} 颜色：{1} 线宽：{2} 线型：{3}
